ahtn/keyplus/efm8/efm8/mcu/EFM8UB3/inc/SI_EFM8UB3_Register_Enums.h
#define ADC0CN0_ADBMEN__BMASK          0x40 ///< Burst Mode Enable                                 
#define ADC0CN0_ADBMEN__SHIFT          0x06 ///< Burst Mode Enable                                 
#define ADC0CN0_ADBMEN__BURST_DISABLED 0x00 ///< Disable ADC0 burst mode.                          
#define ADC0CN0_ADBMEN__BURST_ENABLED  0x40 ///< Enable ADC0 burst mode.                           
                                                                                                   
#define ADC0CN0_ADEN__BMASK            0x80 ///< ADC Enable                                        
#define ADC0CN0_ADEN__SHIFT            0x07 ///< ADC Enable                                        
#define ADC0CN0_ADEN__DISABLED         0x00 ///< Disable ADC0 (low-power shutdown).                
#define ADC0CN0_ADEN__ENABLED          0x80 ///< Enable ADC0 (active and ready for data            
                                            ///< conversions).                                     
                                                                                                   
//------------------------------------------------------------------------------
// ADC0CN1 Enums (ADC0 Control 1 @ 0xB2)
//------------------------------------------------------------------------------
#define ADC0CN1_ADCMBE__BMASK              0x01 ///< Common Mode Buffer Enable                         
#define ADC0CN1_ADCMBE__SHIFT              0x00 ///< Common Mode Buffer Enable                         
#define ADC0CN1_ADCMBE__CM_BUFFER_DISABLED 0x00 ///< Disable the common mode buffer. This setting      
                                                ///< should be used only if the tracking time of the   
                                                ///< signal is greater than 1.5 us.                    
#define ADC0CN1_ADCMBE__CM_BUFFER_ENABLED  0x01 ///< Enable the common mode buffer. This setting should
                                                ///< be used in most cases, and will give the best     
                                                ///< dynamic ADC performance. The common mode buffer   
                                                ///< must be enabled if signal tracking time is less   
                                                ///< than or equal to 1.5 us.                          
                                                                                                       
#define ADC0CN1_ADCM__FMASK                0xF0 ///< Start of Conversion Mode Select                   
#define ADC0CN1_ADCM__SHIFT                0x04 ///< Start of Conversion Mode Select                   
#define ADC0CN1_ADCM__ADBUSY               0x00 ///< ADC0 conversion initiated on write of 1 to ADBUSY.
#define ADC0CN1_ADCM__TIMER0               0x10 ///< ADC0 conversion initiated on overflow of Timer 0. 
#define ADC0CN1_ADCM__TIMER2               0x20 ///< ADC0 conversion initiated on overflow of Timer 2. 
#define ADC0CN1_ADCM__TIMER3               0x30 ///< ADC0 conversion initiated on overflow of Timer 3. 
#define ADC0CN1_ADCM__CNVSTR               0x40 ///< ADC0 conversion initiated on rising edge of       
                                                ///< CNVSTR.                                           
#define ADC0CN1_ADCM__CEX2                 0x50 ///< ADC0 conversion initiated on rising edge of CEX2. 
#define ADC0CN1_ADCM__GATED_TIMER2         0x60 ///< ADC0 conversion initiated on overflow of Timer 2  
                                                ///< when CEX2 is logic high.                          
#define ADC0CN1_ADCM__TIMER4               0x70 ///< ADC0 conversion initiated on overflow of Timer 4. 
#define ADC0CN1_ADCM__TIMER5               0x80 ///< ADC0 conversion initiated on overflow of Timer 5. 
#define ADC0CN1_ADCM__CLU0                 0x90 ///< ADC0 conversion initiated on CLU0 Output.         
#define ADC0CN1_ADCM__CLU1                 0xA0 ///< ADC0 conversion initiated on CLU1 Output.         
#define ADC0CN1_ADCM__CLU2                 0xB0 ///< ADC0 conversion initiated on CLU2 Output.         
#define ADC0CN1_ADCM__CLU3                 0xC0 ///< ADC0 conversion initiated on CLU3 Output.         
                                                                                                       
//------------------------------------------------------------------------------
// ADC0GTH Enums (ADC0 Greater-Than High Byte @ 0xC4)
//------------------------------------------------------------------------------
#define ADC0GTH_ADC0GTH__FMASK 0xFF ///< Greater-Than High Byte
#define ADC0GTH_ADC0GTH__SHIFT 0x00 ///< Greater-Than High Byte
                                                               
//------------------------------------------------------------------------------
// ADC0GTL Enums (ADC0 Greater-Than Low Byte @ 0xC3)
//------------------------------------------------------------------------------
#define ADC0GTL_ADC0GTL__FMASK 0xFF ///< Greater-Than Low Byte
#define ADC0GTL_ADC0GTL__SHIFT 0x00 ///< Greater-Than Low Byte
                                                              
//------------------------------------------------------------------------------
// ADC0H Enums (ADC0 Data Word High Byte @ 0xBE)
//------------------------------------------------------------------------------
#define ADC0H_ADC0H__FMASK 0xFF ///< Data Word High Byte
#define ADC0H_ADC0H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// ADC0L Enums (ADC0 Data Word Low Byte @ 0xBD)
//------------------------------------------------------------------------------
#define ADC0L_ADC0L__FMASK 0xFF ///< Data Word Low Byte
#define ADC0L_ADC0L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// ADC0LTH Enums (ADC0 Less-Than High Byte @ 0xC6)
//------------------------------------------------------------------------------
#define ADC0LTH_ADC0LTH__FMASK 0xFF ///< Less-Than High Byte
#define ADC0LTH_ADC0LTH__SHIFT 0x00 ///< Less-Than High Byte
                                                            
//------------------------------------------------------------------------------
// ADC0LTL Enums (ADC0 Less-Than Low Byte @ 0xC5)
//------------------------------------------------------------------------------
#define ADC0LTL_ADC0LTL__FMASK 0xFF ///< Less-Than Low Byte
#define ADC0LTL_ADC0LTL__SHIFT 0x00 ///< Less-Than Low Byte
                                                           
//------------------------------------------------------------------------------
// ADC0MX Enums (ADC0 Multiplexer Selection @ 0xBB)
//------------------------------------------------------------------------------
#define ADC0MX_ADC0MX__FMASK        0x1F ///< AMUX0 Positive Input Selection
#define ADC0MX_ADC0MX__SHIFT        0x00 ///< AMUX0 Positive Input Selection
#define ADC0MX_ADC0MX__ADC0P0       0x00 ///< Select ADC0.0.                
#define ADC0MX_ADC0MX__ADC0P1       0x01 ///< Select ADC0.1.                
#define ADC0MX_ADC0MX__ADC0P2       0x02 ///< Select ADC0.2.                
#define ADC0MX_ADC0MX__ADC0P3       0x03 ///< Select ADC0.3.                
#define ADC0MX_ADC0MX__ADC0P4       0x04 ///< Select ADC0.4.                
#define ADC0MX_ADC0MX__ADC0P5       0x05 ///< Select ADC0.5.                
#define ADC0MX_ADC0MX__ADC0P6       0x06 ///< Select ADC0.6.                
#define ADC0MX_ADC0MX__ADC0P7       0x07 ///< Select ADC0.7.                
#define ADC0MX_ADC0MX__ADC0P8       0x08 ///< Select ADC0.8.                
#define ADC0MX_ADC0MX__ADC0P9       0x09 ///< Select ADC0.9.                
#define ADC0MX_ADC0MX__ADC0P10      0x0A ///< Select ADC0.10.               
#define ADC0MX_ADC0MX__ADC0P11      0x0B ///< Select ADC0.11.               
#define ADC0MX_ADC0MX__ADC0P12      0x0C ///< Select ADC0.12.               
#define ADC0MX_ADC0MX__ADC0P13      0x0D ///< Select ADC0.13.               
#define ADC0MX_ADC0MX__ADC0P14      0x0E ///< Select ADC0.14.               
#define ADC0MX_ADC0MX__ADC0P15      0x0F ///< Select ADC0.15.               
#define ADC0MX_ADC0MX__TEMP         0x10 ///< Select ADC0.16.               
#define ADC0MX_ADC0MX__LDO_OUT      0x11 ///< Select ADC0.17.               
#define ADC0MX_ADC0MX__VDD          0x12 ///< Select ADC0.18.               
#define ADC0MX_ADC0MX__GND          0x13 ///< Select ADC0.19.               
#define ADC0MX_ADC0MX__ADC0P20      0x14 ///< Select ADC0.20                
#define ADC0MX_ADC0MX__ADC0P21      0x15 ///< Select ADC0.21                
#define ADC0MX_ADC0MX__ADC0P22      0x16 ///< Select ADC0.22                
#define ADC0MX_ADC0MX__ADC0P23      0x17 ///< Select ADC0.23                
#define ADC0MX_ADC0MX__ADC0P24      0x18 ///< Select ADC0.24                
#define ADC0MX_ADC0MX__USB_DP       0x1C ///< Select ADC0.28                
#define ADC0MX_ADC0MX__USB_DM       0x1D ///< Select ADC0.29                
#define ADC0MX_ADC0MX__VREGIN_DIV_4 0x1E ///< Select ADC0.30                
#define ADC0MX_ADC0MX__NONE         0x1F ///< No input selected.            
                                                                            
//------------------------------------------------------------------------------
// ADC0PWR Enums (ADC0 Power Control @ 0xDF)
//------------------------------------------------------------------------------
#define ADC0PWR_ADPWR__FMASK                 0x0F ///< Burst Mode Power Up Time                         
#define ADC0PWR_ADPWR__SHIFT                 0x00 ///< Burst Mode Power Up Time                         
                                                                                                        
