ahtn/keyplus/efm8/efm8/mcu/EFM8UB3/inc/SI_EFM8UB3_Register_Enums.h
#define CLEN0_C3EN__BMASK   0x08 ///< CLU3 Enable                                      
#define CLEN0_C3EN__SHIFT   0x03 ///< CLU3 Enable                                      
#define CLEN0_C3EN__DISABLE 0x00 ///< CLU3 is disabled. The output of the block will be
                                 ///< logic low.                                       
#define CLEN0_C3EN__ENABLE  0x08 ///< CLU3 is enabled.                                 
                                                                                       
//------------------------------------------------------------------------------
// CLIE0 Enums (Configurable Logic Interrupt Enable 0 @ 0xCD)
//------------------------------------------------------------------------------
#define CLIE0_C0FIE__BMASK   0x01 ///< CLU0 Falling Edge Interrupt Enable                
#define CLIE0_C0FIE__SHIFT   0x00 ///< CLU0 Falling Edge Interrupt Enable                
#define CLIE0_C0FIE__DISABLE 0x00 ///< Interrupts will not be generated for CLU0 falling-
                                  ///< edge events.                                      
#define CLIE0_C0FIE__ENABLE  0x01 ///< Interrupts will be generated for CLU0 falling-edge
                                  ///< events.                                           
                                                                                         
#define CLIE0_C0RIE__BMASK   0x02 ///< CLU0 Rising Edge Interrupt Enable                 
#define CLIE0_C0RIE__SHIFT   0x01 ///< CLU0 Rising Edge Interrupt Enable                 
#define CLIE0_C0RIE__DISABLE 0x00 ///< Interrupts will not be generated for CLU0 rising- 
                                  ///< edge events.                                      
#define CLIE0_C0RIE__ENABLE  0x02 ///< Interrupts will be generated for CLU0 rising-edge 
                                  ///< events.                                           
                                                                                         
#define CLIE0_C1FIE__BMASK   0x04 ///< CLU1 Falling Edge Interrupt Enable                
#define CLIE0_C1FIE__SHIFT   0x02 ///< CLU1 Falling Edge Interrupt Enable                
#define CLIE0_C1FIE__DISABLE 0x00 ///< Interrupts will not be generated for CLU1 falling-
                                  ///< edge events.                                      
#define CLIE0_C1FIE__ENABLE  0x04 ///< Interrupts will be generated for CLU1 falling-edge
                                  ///< events.                                           
                                                                                         
#define CLIE0_C1RIE__BMASK   0x08 ///< CLU1 Rising Edge Interrupt Enable                 
#define CLIE0_C1RIE__SHIFT   0x03 ///< CLU1 Rising Edge Interrupt Enable                 
#define CLIE0_C1RIE__DISABLE 0x00 ///< Interrupts will not be generated for CLU1 rising- 
                                  ///< edge events.                                      
#define CLIE0_C1RIE__ENABLE  0x08 ///< Interrupts will be generated for CLU1 rising-edge 
                                  ///< events.                                           
                                                                                         
#define CLIE0_C2FIE__BMASK   0x10 ///< CLU2 Falling Edge Interrupt Enable                
#define CLIE0_C2FIE__SHIFT   0x04 ///< CLU2 Falling Edge Interrupt Enable                
#define CLIE0_C2FIE__DISABLE 0x00 ///< Interrupts will not be generated for CLU2 falling-
                                  ///< edge events.                                      
#define CLIE0_C2FIE__ENABLE  0x10 ///< Interrupts will be generated for CLU2 falling-edge
                                  ///< events.                                           
                                                                                         
#define CLIE0_C2RIE__BMASK   0x20 ///< CLU2 Rising Edge Interrupt Enable                 
#define CLIE0_C2RIE__SHIFT   0x05 ///< CLU2 Rising Edge Interrupt Enable                 
#define CLIE0_C2RIE__DISABLE 0x00 ///< Interrupts will not be generated for CLU2 rising- 
                                  ///< edge events.                                      
#define CLIE0_C2RIE__ENABLE  0x20 ///< Interrupts will be generated for CLU2 rising-edge 
                                  ///< events.                                           
                                                                                         
#define CLIE0_C3FIE__BMASK   0x40 ///< CLU3 Falling Edge Interrupt Enable                
#define CLIE0_C3FIE__SHIFT   0x06 ///< CLU3 Falling Edge Interrupt Enable                
#define CLIE0_C3FIE__DISABLE 0x00 ///< Interrupts will not be generated for CLU3 falling-
                                  ///< edge events.                                      
#define CLIE0_C3FIE__ENABLE  0x40 ///< Interrupts will be generated for CLU3 falling-edge
                                  ///< events.                                           
                                                                                         
#define CLIE0_C3RIE__BMASK   0x80 ///< CLU3 Rising Edge Interrupt Enable                 
#define CLIE0_C3RIE__SHIFT   0x07 ///< CLU3 Rising Edge Interrupt Enable                 
#define CLIE0_C3RIE__DISABLE 0x00 ///< Interrupts will not be generated for CLU3 rising- 
                                  ///< edge events.                                      
#define CLIE0_C3RIE__ENABLE  0x80 ///< Interrupts will be generated for CLU3 rising-edge 
                                  ///< events.                                           
                                                                                         
//------------------------------------------------------------------------------
// CLIF0 Enums (Configurable Logic Interrupt Flag 0 @ 0xE8)
//------------------------------------------------------------------------------
#define CLIF0_C0FIF__BMASK   0x01 ///< CLU0 Falling Edge Flag                            
#define CLIF0_C0FIF__SHIFT   0x00 ///< CLU0 Falling Edge Flag                            
#define CLIF0_C0FIF__NOT_SET 0x00 ///< A CLU0 falling edge has not been detected since   
                                  ///< this flag was last cleared.                       
#define CLIF0_C0FIF__SET     0x01 ///< A CLU0 falling edge (synchronized with SYSCLK) has
                                  ///< occurred. This bit must be cleared by firmware.   
                                                                                         
#define CLIF0_C0RIF__BMASK   0x02 ///< CLU0 Rising Edge Flag                             
#define CLIF0_C0RIF__SHIFT   0x01 ///< CLU0 Rising Edge Flag                             
#define CLIF0_C0RIF__NOT_SET 0x00 ///< A CLU0 rising edge has not been detected since    
                                  ///< this flag was last cleared.                       
#define CLIF0_C0RIF__SET     0x02 ///< A CLU0 rising edge (synchronized with SYSCLK) has 
                                  ///< occurred. This bit must be cleared by firmware.   
                                                                                         
