ahtn/keyplus/efm8/efm8/mcu/EFM8UB3/inc/SI_EFM8UB3_Register_Enums.h
#define EIP2_PT4__BMASK   0x04 ///< Timer 4 Interrupt Priority Control LSB                    
#define EIP2_PT4__SHIFT   0x02 ///< Timer 4 Interrupt Priority Control LSB                    
#define EIP2_PT4__LOW     0x00 ///< Timer 4 interrupt priority LSB set to low.                
#define EIP2_PT4__HIGH    0x04 ///< Timer 4 interrupt priority LSB set to high.               
                                                                                              
#define EIP2_PT5__BMASK   0x08 ///< Timer 5 Interrupt Priority Control LSB                    
#define EIP2_PT5__SHIFT   0x03 ///< Timer 5 Interrupt Priority Control LSB                    
#define EIP2_PT5__LOW     0x00 ///< Timer 5 interrupt priority LSB set to low.                
#define EIP2_PT5__HIGH    0x08 ///< Timer 4 interrupt priority LSB set to high.               
                                                                                              
#define EIP2_PCL0__BMASK  0x40 ///< Configurable Logic (CL0) Interrupt Priority Control LSB   
#define EIP2_PCL0__SHIFT  0x06 ///< Configurable Logic (CL0) Interrupt Priority Control LSB   
#define EIP2_PCL0__LOW    0x00 ///< CL0 interrupt priority LSB set to low.                    
#define EIP2_PCL0__HIGH   0x40 ///< CL0 interrupt priority LSB set to high.                   
                                                                                              
//------------------------------------------------------------------------------
// EIP2H Enums (Extended Interrupt Priority 2 High @ 0xF6)
//------------------------------------------------------------------------------
#define EIP2H_PHUSB0__BMASK 0x01 ///< USB (USB0) Interrupt Priority Control MSB                 
#define EIP2H_PHUSB0__SHIFT 0x00 ///< USB (USB0) Interrupt Priority Control MSB                 
#define EIP2H_PHUSB0__LOW   0x00 ///< USB0 interrupt priority MSB set to low.                   
#define EIP2H_PHUSB0__HIGH  0x01 ///< USB0 interrupt priority MSB set to high.                  
                                                                                                
#define EIP2H_PHVBUS__BMASK 0x02 ///< VBUS and USB Charger Detect Interrupt Priority Control MSB
#define EIP2H_PHVBUS__SHIFT 0x01 ///< VBUS and USB Charger Detect Interrupt Priority Control MSB
#define EIP2H_PHVBUS__LOW   0x00 ///< VBUS / USB Charger Detect interrupt priority MSB          
                                 ///< set to low.                                               
#define EIP2H_PHVBUS__HIGH  0x02 ///< VBUS / USB Charger Detect interrupt priority MSB          
                                 ///< set to high.                                              
                                                                                                
#define EIP2H_PHT4__BMASK   0x04 ///< Timer 4 Interrupt Priority Control MSB                    
#define EIP2H_PHT4__SHIFT   0x02 ///< Timer 4 Interrupt Priority Control MSB                    
#define EIP2H_PHT4__LOW     0x00 ///< Timer 4 interrupt priority MSB set to low.                
#define EIP2H_PHT4__HIGH    0x04 ///< Timer 4 interrupt priority MSB set to high.               
                                                                                                
#define EIP2H_PHT5__BMASK   0x08 ///< Timer 5 Interrupt Priority Control MSB                    
#define EIP2H_PHT5__SHIFT   0x03 ///< Timer 5 Interrupt Priority Control MSB                    
#define EIP2H_PHT5__LOW     0x00 ///< Timer 5 interrupt priority MSB set to low.                
#define EIP2H_PHT5__HIGH    0x08 ///< Timer 5 interrupt priority MSB set to high.               
                                                                                                
#define EIP2H_PHCL0__BMASK  0x40 ///< Configurable Logic (CL0) Interrupt Priority Control MSB   
#define EIP2H_PHCL0__SHIFT  0x06 ///< Configurable Logic (CL0) Interrupt Priority Control MSB   
#define EIP2H_PHCL0__LOW    0x00 ///< CL0 interrupt priority MSB set to low.                    
#define EIP2H_PHCL0__HIGH   0x40 ///< CL0 interrupt priority MSB set to high.                   
                                                                                                
//------------------------------------------------------------------------------
// IE Enums (Interrupt Enable @ 0xA8)
//------------------------------------------------------------------------------
#define IE_EX0__BMASK      0x01 ///< External Interrupt 0 Enable                       
#define IE_EX0__SHIFT      0x00 ///< External Interrupt 0 Enable                       
#define IE_EX0__DISABLED   0x00 ///< Disable external interrupt 0.                     
#define IE_EX0__ENABLED    0x01 ///< Enable interrupt requests generated by the INT0   
                                ///< input.                                            
                                                                                       
#define IE_ET0__BMASK      0x02 ///< Timer 0 Interrupt Enable                          
#define IE_ET0__SHIFT      0x01 ///< Timer 0 Interrupt Enable                          
#define IE_ET0__DISABLED   0x00 ///< Disable all Timer 0 interrupt.                    
#define IE_ET0__ENABLED    0x02 ///< Enable interrupt requests generated by the TF0    
                                ///< flag.                                             
                                                                                       
#define IE_EX1__BMASK      0x04 ///< External Interrupt 1 Enable                       
#define IE_EX1__SHIFT      0x02 ///< External Interrupt 1 Enable                       
#define IE_EX1__DISABLED   0x00 ///< Disable external interrupt 1.                     
#define IE_EX1__ENABLED    0x04 ///< Enable interrupt requests generated by the INT1   
                                ///< input.                                            
                                                                                       
#define IE_ET1__BMASK      0x08 ///< Timer 1 Interrupt Enable                          
#define IE_ET1__SHIFT      0x03 ///< Timer 1 Interrupt Enable                          
#define IE_ET1__DISABLED   0x00 ///< Disable all Timer 1 interrupt.                    
#define IE_ET1__ENABLED    0x08 ///< Enable interrupt requests generated by the TF1    
                                ///< flag.                                             
                                                                                       
