ahtn/keyplus/efm8/efm8/mcu/EFM8UB3/inc/SI_EFM8UB3_Register_Enums.h
#define SPI0PCF_MISEL__FMASK     0x18 ///< Master MISO Input Select                          
#define SPI0PCF_MISEL__SHIFT     0x03 ///< Master MISO Input Select                          
#define SPI0PCF_MISEL__CROSSBAR  0x00 ///< The crossbar input is the MISO input (master      
                                      ///< mode).                                            
#define SPI0PCF_MISEL__CLU0      0x08 ///< The CLU0 synchronous output is the MISO input     
                                      ///< (master mode).                                    
#define SPI0PCF_MISEL__CLU2      0x10 ///< The CLU2 synchronous output is the MISO input     
                                      ///< (master mode).                                    
#define SPI0PCF_MISEL__CLU3      0x18 ///< The CLU3 synchronous output is the MISO input     
                                      ///< (master mode).                                    
                                                                                             
#define SPI0PCF_SCKSEL__FMASK    0xC0 ///< Slave Clock Input Select                          
#define SPI0PCF_SCKSEL__SHIFT    0x06 ///< Slave Clock Input Select                          
#define SPI0PCF_SCKSEL__CROSSBAR 0x00 ///< The crossbar input is the SCK input (slave mode). 
#define SPI0PCF_SCKSEL__CLU1     0x40 ///< The CLU1 synchronous output is the SCK input      
                                      ///< (slave mode).                                     
#define SPI0PCF_SCKSEL__CLU2     0x80 ///< The CLU2 synchronous output is the SCK input      
                                      ///< (slave mode).                                     
#define SPI0PCF_SCKSEL__CLU3     0xC0 ///< The CLU3 synchronous output is the SCK input      
                                      ///< (slave mode).                                     
                                                                                             
//------------------------------------------------------------------------------
// TH0 Enums (Timer 0 High Byte @ 0x8C)
//------------------------------------------------------------------------------
#define TH0_TH0__FMASK 0xFF ///< Timer 0 High Byte
#define TH0_TH0__SHIFT 0x00 ///< Timer 0 High Byte
                                                  
//------------------------------------------------------------------------------
// TH1 Enums (Timer 1 High Byte @ 0x8D)
//------------------------------------------------------------------------------
#define TH1_TH1__FMASK 0xFF ///< Timer 1 High Byte
#define TH1_TH1__SHIFT 0x00 ///< Timer 1 High Byte
                                                  
//------------------------------------------------------------------------------
// TL0 Enums (Timer 0 Low Byte @ 0x8A)
//------------------------------------------------------------------------------
#define TL0_TL0__FMASK 0xFF ///< Timer 0 Low Byte
#define TL0_TL0__SHIFT 0x00 ///< Timer 0 Low Byte
                                                 
//------------------------------------------------------------------------------
// TL1 Enums (Timer 1 Low Byte @ 0x8B)
//------------------------------------------------------------------------------
#define TL1_TL1__FMASK 0xFF ///< Timer 1 Low Byte
#define TL1_TL1__SHIFT 0x00 ///< Timer 1 Low Byte
                                                 
//------------------------------------------------------------------------------
// TMR2CN0 Enums (Timer 2 Control 0 @ 0xC8)
//------------------------------------------------------------------------------
#define TMR2CN0_T2XCLK__FMASK          0x03 ///< Timer 2 External Clock Select                    
#define TMR2CN0_T2XCLK__SHIFT          0x00 ///< Timer 2 External Clock Select                    
#define TMR2CN0_T2XCLK__SYSCLK_DIV_12  0x00 ///< Timer 2 clock is the system clock divided by 12. 
#define TMR2CN0_T2XCLK__EXTOSC_DIV_8   0x01 ///< Timer 2 clock is the external oscillator divided 
                                            ///< by 8 (synchronized with SYSCLK).                 
                                                                                                  
#define TMR2CN0_TR2__BMASK             0x04 ///< Timer 2 Run Control                              
#define TMR2CN0_TR2__SHIFT             0x02 ///< Timer 2 Run Control                              
#define TMR2CN0_TR2__STOP              0x00 ///< Stop Timer 2.                                    
#define TMR2CN0_TR2__RUN               0x04 ///< Start Timer 2 running.                           
                                                                                                  
#define TMR2CN0_T2SPLIT__BMASK         0x08 ///< Timer 2 Split Mode Enable                        
#define TMR2CN0_T2SPLIT__SHIFT         0x03 ///< Timer 2 Split Mode Enable                        
#define TMR2CN0_T2SPLIT__16_BIT_RELOAD 0x00 ///< Timer 2 operates in 16-bit auto-reload mode.     
#define TMR2CN0_T2SPLIT__8_BIT_RELOAD  0x08 ///< Timer 2 operates as two 8-bit auto-reload timers.
                                                                                                  
#define TMR2CN0_TF2CEN__BMASK          0x10 ///< Timer 2 Capture Enable                           
#define TMR2CN0_TF2CEN__SHIFT          0x04 ///< Timer 2 Capture Enable                           
#define TMR2CN0_TF2CEN__DISABLED       0x00 ///< Disable capture mode.                            
#define TMR2CN0_TF2CEN__ENABLED        0x10 ///< Enable capture mode.                             
                                                                                                  
#define TMR2CN0_TF2LEN__BMASK          0x20 ///< Timer 2 Low Byte Interrupt Enable                
#define TMR2CN0_TF2LEN__SHIFT          0x05 ///< Timer 2 Low Byte Interrupt Enable                
#define TMR2CN0_TF2LEN__DISABLED       0x00 ///< Disable low byte interrupts.                     
#define TMR2CN0_TF2LEN__ENABLED        0x20 ///< Enable low byte interrupts.                      
                                                                                                  
