ahtn/keyplus/efm8/efm8/mcu/EFM8UB3/inc/SI_EFM8UB3_Register_Enums.h
#define TMR3CN0_TF3CEN__BMASK          0x10 ///< Timer 3 Capture Enable                           
#define TMR3CN0_TF3CEN__SHIFT          0x04 ///< Timer 3 Capture Enable                           
#define TMR3CN0_TF3CEN__DISABLED       0x00 ///< Disable capture mode.                            
#define TMR3CN0_TF3CEN__ENABLED        0x10 ///< Enable capture mode.                             
                                                                                                  
#define TMR3CN0_TF3LEN__BMASK          0x20 ///< Timer 3 Low Byte Interrupt Enable                
#define TMR3CN0_TF3LEN__SHIFT          0x05 ///< Timer 3 Low Byte Interrupt Enable                
#define TMR3CN0_TF3LEN__DISABLED       0x00 ///< Disable low byte interrupts.                     
#define TMR3CN0_TF3LEN__ENABLED        0x20 ///< Enable low byte interrupts.                      
                                                                                                  
#define TMR3CN0_TF3L__BMASK            0x40 ///< Timer 3 Low Byte Overflow Flag                   
#define TMR3CN0_TF3L__SHIFT            0x06 ///< Timer 3 Low Byte Overflow Flag                   
#define TMR3CN0_TF3L__NOT_SET          0x00 ///< Timer 3 low byte did not overflow.               
#define TMR3CN0_TF3L__SET              0x40 ///< Timer 3 low byte overflowed.                     
                                                                                                  
#define TMR3CN0_TF3H__BMASK            0x80 ///< Timer 3 High Byte Overflow Flag                  
#define TMR3CN0_TF3H__SHIFT            0x07 ///< Timer 3 High Byte Overflow Flag                  
#define TMR3CN0_TF3H__NOT_SET          0x00 ///< Timer 3 8-bit high byte or 16-bit value did not  
                                            ///< overflow.                                        
#define TMR3CN0_TF3H__SET              0x80 ///< Timer 3 8-bit high byte or 16-bit value          
                                            ///< overflowed.                                      
                                                                                                  
//------------------------------------------------------------------------------
// TMR3CN1 Enums (Timer 3 Control 1 @ 0xFE)
//------------------------------------------------------------------------------
#define TMR3CN1_T3CSEL__FMASK       0x07 ///< Timer 3 Capture Select                           
#define TMR3CN1_T3CSEL__SHIFT       0x00 ///< Timer 3 Capture Select                           
#define TMR3CN1_T3CSEL__PIN         0x00 ///< Capture high-to-low transitions on the T2 input  
                                         ///< pin.                                             
#define TMR3CN1_T3CSEL__LFOSC       0x01 ///< Capture high-to-low transitions of the LFO       
                                         ///< oscillator.                                      
#define TMR3CN1_T3CSEL__COMPARATOR0 0x02 ///< Capture high-to-low transitions of the Comparator
                                         ///< 0 output.                                        
#define TMR3CN1_T3CSEL__USB_SOF     0x03 ///< Capture USB start-of-frame (SOF) events.         
#define TMR3CN1_T3CSEL__CLU0_OUT    0x04 ///< Capture high-to-low transitions on the           
                                         ///< configurable logic unit 0 synchronous output.    
#define TMR3CN1_T3CSEL__CLU1_OUT    0x05 ///< Capture high-to-low transitions on the           
                                         ///< configurable logic unit 1 synchronous output.    
#define TMR3CN1_T3CSEL__CLU2_OUT    0x06 ///< Capture high-to-low transitions on the           
                                         ///< configurable logic unit 2 synchronous output.    
#define TMR3CN1_T3CSEL__CLU3_OUT    0x07 ///< Capture high-to-low transitions on the           
                                         ///< configurable logic unit 3 synchronous output.    
                                                                                               
#define TMR3CN1_STSYNC__BMASK       0x10 ///< Suspend Timer Synchronization Status             
#define TMR3CN1_STSYNC__SHIFT       0x04 ///< Suspend Timer Synchronization Status             
#define TMR3CN1_STSYNC__NOT_SET     0x00 ///< It is safe to read and write the timer registers.
#define TMR3CN1_STSYNC__SET         0x10 ///< Reads and writes of the timer register should not
                                         ///< be performed                                     
                                                                                               
#define TMR3CN1_RLFSEL__FMASK       0xE0 ///< Force Reload Select                              
#define TMR3CN1_RLFSEL__SHIFT       0x05 ///< Force Reload Select                              
#define TMR3CN1_RLFSEL__SMB_SCL     0x00 ///< If SMBTOE is 0, then this is always 0. If SMBTOE 
                                         ///< is 1, then the timer will only reload on overflow
                                         ///< events and when the SMB0 SCL signal is high.     
#define TMR3CN1_RLFSEL__CLU0_OUT    0x20 ///< Timer will reload on overflow events and CLU0    
                                         ///< synchronous output high.                         
#define TMR3CN1_RLFSEL__CLU1_OUT    0x40 ///< Timer will reload on overflow events and CLU1    
                                         ///< synchronous output high.                         
#define TMR3CN1_RLFSEL__CLU2_OUT    0x60 ///< Timer will reload on overflow events and CLU2    
                                         ///< synchronous output high.                         
#define TMR3CN1_RLFSEL__NONE        0x80 ///< Timer will only reload on overflow events.       
                                                                                               
//------------------------------------------------------------------------------
// TMR3H Enums (Timer 3 High Byte @ 0x95)
//------------------------------------------------------------------------------
#define TMR3H_TMR3H__FMASK 0xFF ///< Timer 3 High Byte
#define TMR3H_TMR3H__SHIFT 0x00 ///< Timer 3 High Byte
                                                      
//------------------------------------------------------------------------------
// TMR3L Enums (Timer 3 Low Byte @ 0x94)
//------------------------------------------------------------------------------
#define TMR3L_TMR3L__FMASK 0xFF ///< Timer 3 Low Byte
#define TMR3L_TMR3L__SHIFT 0x00 ///< Timer 3 Low Byte
                                                     
//------------------------------------------------------------------------------
// TMR3RLH Enums (Timer 3 Reload High Byte @ 0x93)
//------------------------------------------------------------------------------
#define TMR3RLH_TMR3RLH__FMASK 0xFF ///< Timer 3 Reload High Byte
#define TMR3RLH_TMR3RLH__SHIFT 0x00 ///< Timer 3 Reload High Byte
                                                                 
//------------------------------------------------------------------------------
// TMR3RLL Enums (Timer 3 Reload Low Byte @ 0x92)
//------------------------------------------------------------------------------
#define TMR3RLL_TMR3RLL__FMASK 0xFF ///< Timer 3 Reload Low Byte
#define TMR3RLL_TMR3RLL__SHIFT 0x00 ///< Timer 3 Reload Low Byte
                                                                
//------------------------------------------------------------------------------
// TMR4CN0 Enums (Timer 4 Control 0 @ 0x98)
//------------------------------------------------------------------------------
#define TMR4CN0_T4XCLK__FMASK          0x03 ///< Timer 4 External Clock Select                    
#define TMR4CN0_T4XCLK__SHIFT          0x00 ///< Timer 4 External Clock Select                    
#define TMR4CN0_T4XCLK__SYSCLK_DIV_12  0x00 ///< Timer 4 clock is the system clock divided by 12. 
#define TMR4CN0_T4XCLK__EXTOSC_DIV_8   0x01 ///< Timer 4 clock is the external oscillator divided 
                                            ///< by 8 (synchronized with SYSCLK).                 
#define TMR4CN0_T4XCLK__TIMER3         0x02 ///< Timer 4 is clocked by Timer 3 overflows.         
#define TMR4CN0_T4XCLK__LFOSC_DIV_8    0x03 ///< Timer 4 clock is the low-frequency oscillator    
                                            ///< divided by 8 (synchronized with SYSCLK).         
                                                                                                  
#define TMR4CN0_TR4__BMASK             0x04 ///< Timer 4 Run Control                              
#define TMR4CN0_TR4__SHIFT             0x02 ///< Timer 4 Run Control                              
#define TMR4CN0_TR4__STOP              0x00 ///< Stop Timer 4.                                    
#define TMR4CN0_TR4__RUN               0x04 ///< Start Timer 4 running.                           
                                                                                                  
