ahtn/keyplus/efm8/efm8/mcu/EFM8UB3/inc/SI_EFM8UB3_Register_Enums.h
//------------------------------------------------------------------------------
// POWER Enums (USB0 Power @ 0x01)
//------------------------------------------------------------------------------
#define POWER_SUSEN__BMASK         0x01 ///< Suspend Detection Enable                          
#define POWER_SUSEN__SHIFT         0x00 ///< Suspend Detection Enable                          
#define POWER_SUSEN__DISABLED      0x00 ///< Disable suspend detection. USB0 will ignore       
                                        ///< suspend signaling on the bus.                     
#define POWER_SUSEN__ENABLED       0x01 ///< Enable suspend detection. USB0 will enter suspend 
                                        ///< mode if it detects suspend signaling on the bus.  
                                                                                               
#define POWER_SUSMD__BMASK         0x02 ///< Suspend Mode                                      
#define POWER_SUSMD__SHIFT         0x01 ///< Suspend Mode                                      
#define POWER_SUSMD__NOT_SUSPENDED 0x00 ///< USB0 not in suspend mode.                         
#define POWER_SUSMD__SUSPENDED     0x02 ///< USB0 in suspend mode.                             
                                                                                               
#define POWER_RESUME__BMASK        0x04 ///< Force Resume                                      
#define POWER_RESUME__SHIFT        0x02 ///< Force Resume                                      
#define POWER_RESUME__START        0x04 ///< Generate resume signalling to create a remote     
                                        ///< wakeup event.                                     
                                                                                               
#define POWER_USBRST__BMASK        0x08 ///< Reset Detect                                      
#define POWER_USBRST__SHIFT        0x03 ///< Reset Detect                                      
#define POWER_USBRST__NOT_SET      0x00 ///< USB reset signalling not detected.                
#define POWER_USBRST__SET          0x08 ///< USB reset signalling detected.                    
                                                                                               
#define POWER_USBINH__BMASK        0x10 ///< USB0 Inhibit                                      
#define POWER_USBINH__SHIFT        0x04 ///< USB0 Inhibit                                      
#define POWER_USBINH__ENABLED      0x00 ///< USB0 enabled.                                     
#define POWER_USBINH__DISABLED     0x10 ///< USB0 inhibited. All USB traffic is ignored.       
                                                                                               
#define POWER_ISOUD__BMASK         0x80 ///< Isochronous Update Mode                           
#define POWER_ISOUD__SHIFT         0x07 ///< Isochronous Update Mode                           
#define POWER_ISOUD__IN_TOKEN      0x00 ///< When firmware writes INPRDY = 1, USB0 will send   
                                        ///< the packet when the next IN token is received.    
#define POWER_ISOUD__SOF_TOKEN     0x80 ///< When firmware writes INPRDY = 1, USB0 will wait   
                                        ///< for a SOF token before sending the packet. If an  
                                        ///< IN token is received before a SOF token, USB0 will
                                        ///< send a zero-length data packet.                   
                                                                                               
//------------------------------------------------------------------------------
// USB0ADR Enums (USB0 Indirect Address @ 0xAE)
//------------------------------------------------------------------------------
#define USB0ADR_USB0ADR__FMASK          0x3F ///< USB0 Indirect Register Address                    
#define USB0ADR_USB0ADR__SHIFT          0x00 ///< USB0 Indirect Register Address                    
#define USB0ADR_USB0ADR__FADDR          0x00 ///< Function Address.                                 
#define USB0ADR_USB0ADR__POWER          0x01 ///< Power Management.                                 
#define USB0ADR_USB0ADR__IN1INT         0x02 ///< Endpoint 0 and Endpoints 1-3 IN Interrupt Flags.  
#define USB0ADR_USB0ADR__OUT1INT        0x04 ///< Endpoints 1-3 OUT Interrupt Flags.                
#define USB0ADR_USB0ADR__CMINT          0x06 ///< Common USB Interrupt Flags.                       
#define USB0ADR_USB0ADR__IN1IE          0x07 ///< Endpoint 0 and Endpoints 1-3 IN Interrupt Enables.
#define USB0ADR_USB0ADR__OUT1IE         0x09 ///< Endpoints 1-3 OUT Interrupt Enables.              
#define USB0ADR_USB0ADR__CMIE           0x0B ///< Common USB Interrupt Enables.                     
#define USB0ADR_USB0ADR__FRAMEL         0x0C ///< Frame Number Low Byte.                            
#define USB0ADR_USB0ADR__FRAMEH         0x0D ///< Frame Number High Byte.                           
#define USB0ADR_USB0ADR__INDEX          0x0E ///< Endpoint Index Selection.                         
#define USB0ADR_USB0ADR__CLKREC         0x0F ///< Clock Recovery Control.                           
#define USB0ADR_USB0ADR__E0CSR_EINCSRL  0x11 ///< Endpoint 0 Control / Status, Endpoint IN Control /
                                             ///< Status Low Byte.                                  
#define USB0ADR_USB0ADR__EINCSRH        0x12 ///< Endpoint IN Control / Status High Byte.           
#define USB0ADR_USB0ADR__EOUTCSRL       0x14 ///< Endpoint OUT Control / Status Low Byte.           
#define USB0ADR_USB0ADR__EOUTCSRH       0x15 ///< Endpoint OUT Control / Status High Byte.          
#define USB0ADR_USB0ADR__E0CNT_EOUTCNTL 0x16 ///< Number of Received Bytes in Endpoint 0 FIFO,      
                                             ///< Endpoint OUT Packet Count Low Byte.               
#define USB0ADR_USB0ADR__EOUTCNTH       0x17 ///< Endpoint OUT Packet Count High Byte.              
#define USB0ADR_USB0ADR__EENABLE        0x1E ///< Endpoint Enable.                                  
#define USB0ADR_USB0ADR__FIFO0          0x20 ///< Endpoint 0 FIFO.                                  
#define USB0ADR_USB0ADR__FIFO1          0x21 ///< Endpoint 1 FIFO.                                  
#define USB0ADR_USB0ADR__FIFO2          0x22 ///< Endpoint 2 FIFO.                                  
#define USB0ADR_USB0ADR__FIFO3          0x23 ///< Endpoint 3 FIFO.                                  
                                                                                                    
#define USB0ADR_AUTORD__BMASK           0x40 ///< USB0 Register Auto-Read Flag                      
#define USB0ADR_AUTORD__SHIFT           0x06 ///< USB0 Register Auto-Read Flag                      
#define USB0ADR_AUTORD__DISABLED        0x00 ///< BUSY must be written manually for each USB0       
                                             ///< indirect register read.                           
#define USB0ADR_AUTORD__ENABLED         0x40 ///< The next indirect register read will automatically
                                             ///< be initiated when firmware reads USB0DAT (USBADDR 
                                             ///< bits will not be changed).                        
                                                                                                    
#define USB0ADR_BUSY__BMASK             0x80 ///< USB0 Register Read Busy Flag                      
#define USB0ADR_BUSY__SHIFT             0x07 ///< USB0 Register Read Busy Flag                      
#define USB0ADR_BUSY__NOT_SET           0x00 ///< A read is not in progress.                        
#define USB0ADR_BUSY__SET               0x80 ///< Initiate a read or a read is in progress.         
                                                                                                    
//------------------------------------------------------------------------------
// USB0AEC Enums (USB0 Advanced Energy Control @ 0xB2)
//------------------------------------------------------------------------------
#define USB0AEC_LEMCN__FMASK             0x03 ///< Low Energy Mode Control                          
#define USB0AEC_LEMCN__SHIFT             0x00 ///< Low Energy Mode Control                          
#define USB0AEC_LEMCN__DISABLED          0x00 ///< LE mode is disabled.                             
#define USB0AEC_LEMCN__IDLE              0x01 ///< LE takes effect only during idle bus times.      
#define USB0AEC_LEMCN__NAK_OUT           0x02 ///< LE takes effect only during NAKed OUT packets.   
#define USB0AEC_LEMCN__ALL               0x03 ///< LE takes effect during idle bus and NAKed OUT    
                                              ///< packets.                                         
                                                                                                    
#define USB0AEC_OSCMD__FMASK             0x30 ///< Low Energy Mode Oscillator Control               
#define USB0AEC_OSCMD__SHIFT             0x04 ///< Low Energy Mode Oscillator Control               
#define USB0AEC_OSCMD__OSC_GATED_SUSPEND 0x00 ///< The USB clock source is selectively gated by LE  
                                              ///< mode, and the High-Frequency Oscillator (HFOSC1) 
                                              ///< is suspended if possible.                        
#define USB0AEC_OSCMD__OSC_GATED         0x10 ///< The USB clock source is selectively gated by LE  
                                              ///< mode. There is no effect to HFOSC1.              
#define USB0AEC_OSCMD__OSC_ON            0x30 ///< LE mode has no effect on either the USB clock or 
                                              ///< HFOSC1.                                          
                                                                                                    
#define USB0AEC_XCVRMD__BMASK            0x40 ///< Transceiver Mode                                 
#define USB0AEC_XCVRMD__SHIFT            0x06 ///< Transceiver Mode                                 
#define USB0AEC_XCVRMD__LOW_POWER        0x00 ///< The USB transceiver is selectively put into a    
                                              ///< lower power state when low energy mode is active.
#define USB0AEC_XCVRMD__NORMAL_POWER     0x40 ///< The USB transceiver is not affected by low energy
                                              ///< mode.                                            
                                                                                                    
#define USB0AEC_LEMSTA__BMASK            0x80 ///< Low Energy Mode Status                           
#define USB0AEC_LEMSTA__SHIFT            0x07 ///< Low Energy Mode Status                           
#define USB0AEC_LEMSTA__OFF              0x00 ///< The USB peripheral is in normal mode.            
#define USB0AEC_LEMSTA__ON               0x80 ///< The USB peripheral is in a low energy mode.      
                                                                                                    
//------------------------------------------------------------------------------
// USB0CDCF Enums (USB0 Charger Detect Configuration @ 0xB6)
//------------------------------------------------------------------------------
#define USB0CDCF_DCDIE__BMASK    0x02 ///< DCD Interrupt Enable                              
#define USB0CDCF_DCDIE__SHIFT    0x01 ///< DCD Interrupt Enable                              
#define USB0CDCF_DCDIE__DISABLED 0x00 ///< DCDI will not generate charger detect interrupts. 
#define USB0CDCF_DCDIE__ENABLED  0x02 ///< DCDI allowed to generate charger detect           
                                      ///< interrupts.                                       
                                                                                             
#define USB0CDCF_PDIE__BMASK     0x04 ///< PD Interrupt Enable                               
#define USB0CDCF_PDIE__SHIFT     0x02 ///< PD Interrupt Enable                               
#define USB0CDCF_PDIE__DISABLED  0x00 ///< PDI will not generate charger detect interrupts.  
#define USB0CDCF_PDIE__ENABLED   0x04 ///< PDI allowed to generate charger detect interrupts.
                                                                                             
#define USB0CDCF_SDIE__BMASK     0x08 ///< SD Interrupt Enable                               
#define USB0CDCF_SDIE__SHIFT     0x03 ///< SD Interrupt Enable                               
#define USB0CDCF_SDIE__DISABLED  0x00 ///< SDI will not generate charger detect interrupts.  
#define USB0CDCF_SDIE__ENABLED   0x08 ///< SDI allowed to generate charger detect interrupts.
                                                                                             
//------------------------------------------------------------------------------
// USB0CDCN Enums (USB0 Charger Detect Control @ 0xBE)
//------------------------------------------------------------------------------
#define USB0CDCN_DCDEN__FMASK    0x03 ///< Data Contact Detection Enable                    
#define USB0CDCN_DCDEN__SHIFT    0x00 ///< Data Contact Detection Enable                    
#define USB0CDCN_DCDEN__DISABLED 0x00 ///< DCD is disabled.                                 
#define USB0CDCN_DCDEN__TIMEOUT  0x02 ///< Only DCD timeout will be initiated.              
#define USB0CDCN_DCDEN__ENABLED  0x03 ///< Full DCD operation (physical contact and timeout)
                                      ///< will be initiated.                               
                                                                                            
#define USB0CDCN_PDEN__BMASK     0x04 ///< Primary Detection Enable                         
#define USB0CDCN_PDEN__SHIFT     0x02 ///< Primary Detection Enable                         
#define USB0CDCN_PDEN__DISABLED  0x00 ///< Disable primary detection.                       
#define USB0CDCN_PDEN__ENABLED   0x04 ///< Enable primary detection.                        
                                                                                            
