ahtn/keyplus/efm8/efm8/mcu/EFM8UB3/inc/SI_EFM8UB3_Register_Enums.h
#define USB0CF_VBUSI__BMASK         0x20 ///< VBUS Interrupt                                    
#define USB0CF_VBUSI__SHIFT         0x05 ///< VBUS Interrupt                                    
#define USB0CF_VBUSI__NOT_SET       0x00 ///< A VBUS event has not occurred.                    
#define USB0CF_VBUSI__SET           0x20 ///< A VBUS event has occurred.                        
                                                                                                
#define USB0CF_VBUSIE__BMASK        0x40 ///< VBUS Interrupt Enable                             
#define USB0CF_VBUSIE__SHIFT        0x06 ///< VBUS Interrupt Enable                             
#define USB0CF_VBUSIE__DISABLED     0x00 ///< The VBUS sense signal will not generate           
                                         ///< interrupts.                                       
#define USB0CF_VBUSIE__ENABLED      0x40 ///< The VBUS sense signal may generate VBUS interrupts
                                         ///< when a VBUS event is deteted. The VBUS interrupt  
                                         ///< must be enabled in the main interrupt controller  
                                         ///< for the interrupt to occur.                       
                                                                                                
#define USB0CF_VBUSEN__BMASK        0x80 ///< VBUS Sense Enable                                 
#define USB0CF_VBUSEN__SHIFT        0x07 ///< VBUS Sense Enable                                 
#define USB0CF_VBUSEN__DISABLED     0x00 ///< The VBUS pin can be used as GPIO.                 
#define USB0CF_VBUSEN__ENABLED      0x80 ///< The VBUS pin is used to sense the USB VBUS signal 
                                         ///< voltage.                                          
                                                                                                
//------------------------------------------------------------------------------
// USB0DAT Enums (USB0 Data @ 0xAF)
//------------------------------------------------------------------------------
#define USB0DAT_USB0DAT__FMASK 0xFF ///< USB0 Data
#define USB0DAT_USB0DAT__SHIFT 0x00 ///< USB0 Data
                                                  
//------------------------------------------------------------------------------
// USB0XCN Enums (USB0 Transceiver Control @ 0xB3)
//------------------------------------------------------------------------------
#define USB0XCN_Dn__BMASK                0x01 ///< D- Signal Status                                 
#define USB0XCN_Dn__SHIFT                0x00 ///< D- Signal Status                                 
#define USB0XCN_Dn__LOW                  0x00 ///< D- signal currently at logic 0.                  
#define USB0XCN_Dn__HIGH                 0x01 ///< D- signal currently at logic 1.                  
                                                                                                    
#define USB0XCN_Dp__BMASK                0x02 ///< D+ Signal Status                                 
#define USB0XCN_Dp__SHIFT                0x01 ///< D+ Signal Status                                 
#define USB0XCN_Dp__LOW                  0x00 ///< D+ signal currently at logic 0.                  
#define USB0XCN_Dp__HIGH                 0x02 ///< D+ signal currently at logic 1.                  
                                                                                                    
#define USB0XCN_DFREC__BMASK             0x04 ///< Differential Receiver                            
#define USB0XCN_DFREC__SHIFT             0x02 ///< Differential Receiver                            
#define USB0XCN_DFREC__DIFFERENTIAL_ZERO 0x00 ///< Differential 0 signalling on the bus.            
#define USB0XCN_DFREC__DIFFERENTIAL_ONE  0x04 ///< Differential 1 signalling on the bus.            
                                                                                                    
#define USB0XCN_PHYTST__FMASK            0x18 ///< Physical Layer Test                              
#define USB0XCN_PHYTST__SHIFT            0x03 ///< Physical Layer Test                              
#define USB0XCN_PHYTST__MODE0            0x00 ///< Mode 0: Normal (non-test mode) (D+ = X, D- = X). 
#define USB0XCN_PHYTST__MODE1            0x08 ///< Mode 1: Differential 1 forced (D+ = 1, D- = 0).  
#define USB0XCN_PHYTST__MODE2            0x10 ///< Mode 2: Differential 0 forced (D+ = 0, D- = 1).  
#define USB0XCN_PHYTST__MODE3            0x18 ///< Mode 3: Single-Ended 0 forced (D+ = 0, D- = 0).  
                                                                                                    
#define USB0XCN_SPEED__BMASK             0x20 ///< USB0 Speed Select                                
#define USB0XCN_SPEED__SHIFT             0x05 ///< USB0 Speed Select                                
#define USB0XCN_SPEED__LOW_SPEED         0x00 ///< USB0 operates as a Low Speed device. If enabled, 
                                              ///< the internal pull-up resistor appears on the D-  
                                              ///< line.                                            
#define USB0XCN_SPEED__FULL_SPEED        0x20 ///< USB0 operates as a Full Speed device. If enabled,
                                              ///< the internal pull-up resistor appears on the D+  
                                              ///< line.                                            
                                                                                                    
#define USB0XCN_PHYEN__BMASK             0x40 ///< Physical Layer Enable                            
#define USB0XCN_PHYEN__SHIFT             0x06 ///< Physical Layer Enable                            
#define USB0XCN_PHYEN__DISABLED          0x00 ///< Disable the USB0 physical layer transceiver      
                                              ///< (suspend).                                       
#define USB0XCN_PHYEN__ENABLED           0x40 ///< Enable the USB0 physical layer transceiver       
                                              ///< (normal).                                        
                                                                                                    
#define USB0XCN_PREN__BMASK              0x80 ///< Internal Pull-up Resistor Enable                 
#define USB0XCN_PREN__SHIFT              0x07 ///< Internal Pull-up Resistor Enable                 
#define USB0XCN_PREN__PULL_UP_DISABLED   0x00 ///< Internal pull-up resistor disabled (device       
                                              ///< effectively detached from USB network).          
#define USB0XCN_PREN__PULL_UP_ENABLED    0x80 ///< Internal pull-up resistor enabled when VBUS is   
                                              ///< present (device attached to the USB network).    
                                                                                                    
//------------------------------------------------------------------------------
// VDM0CN Enums (Supply Monitor Control @ 0xFF)
//------------------------------------------------------------------------------
#define VDM0CN_VDDSTAT__BMASK  0x40 ///< Supply Status                                   
#define VDM0CN_VDDSTAT__SHIFT  0x06 ///< Supply Status                                   
#define VDM0CN_VDDSTAT__BELOW  0x00 ///< VDD is at or below the supply monitor threshold.
#define VDM0CN_VDDSTAT__ABOVE  0x40 ///< VDD is above the supply monitor threshold.      
                                                                                         
